# Ileri Birlestirme Islmeleri

In [2]:
import pandas as pd
import numpy as np

In [5]:
df1 = pd.DataFrame({'calisanalar' : ['Ali', 'Veli', 'Ayse', 'Fatma'],
                   'grup' : ['Muhasebe', 'Muh', 'Muh', 'IK']})
df1

  calisanalar      grup
0         Ali  Muhasebe
1        Veli       Muh
2        Ayse       Muh
3       Fatma        IK

In [6]:
df2 = pd.DataFrame({'calisanalar' : ['Ali', 'Veli', 'Ayse', 'Fatma'],
                   'ilk_giris' : [2010, 2009, 2014, 2019]})
df2

  calisanalar  ilk_giris
0         Ali       2010
1        Veli       2009
2        Ayse       2014
3       Fatma       2019

In [7]:
pd.concat([df1,df2])

  calisanalar      grup  ilk_giris
0         Ali  Muhasebe        NaN
1        Veli       Muh        NaN
2        Ayse       Muh        NaN
3       Fatma        IK        NaN
0         Ali       NaN     2010.0
1        Veli       NaN     2009.0
2        Ayse       NaN     2014.0
3       Fatma       NaN     2019.0

In [9]:
pd.merge(df1,df2)

  calisanalar      grup  ilk_giris
0         Ali  Muhasebe       2010
1        Veli       Muh       2009
2        Ayse       Muh       2014
3       Fatma        IK       2019